using System;
namespace PascalTriangleDemo
{
    class Example
    {
        public static void Main()
        {
            int rows = int.Parse(Console.ReadLine()); // четат се броя редове

            int val = 1; // началната стойност винаги е 1

            for (int i = 0; i < rows; i++) // броят редове, които се печатат, е равен на въведеното число
            {
                for (int j = 0; j <= i; j++) // броят на числата, които трябва да се въведат на всеки ред с максимална стойност броя на редовете
                {
                    if (j == 0 || i == 0) // ако една от двете стойности е нула, то излизаме от триъгълника и крайната стойност става 1
                        val = 1;
                    else
                        val = val * (i - j + 1) / j; // използваме специална формула за триъгълник на Паскал
                    Console.Write(val + " "); // печатаме последователно числата
                }
                Console.WriteLine(); // печатаме нов ред
            }
        }
    }
}